1C/InformationRegisters/EPA_Тригеры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>EPA_Тригеры</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Действия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.EPA_Действия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.EPA_Пользователь</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектСистемы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

1C/InformationRegisters/EPA_Тригеры/Ext/ManagerModule.bsl
Функция ТригерСработал(Пользователь, Действие, Объект) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	EPA_Тригеры.Пользователь КАК Пользователь
		|ИЗ
		|	РегистрСведений.EPA_Тригеры КАК EPA_Тригеры
		|ГДЕ
		|	EPA_Тригеры.Пользователь = &Пользователь
		|	И EPA_Тригеры.ОбъектСистемы = &ОбъектСистемы
		|	И EPA_Тригеры.Действия = &Действия";
	                                                       
	Запрос.УстановитьПараметр("Действия", Действие);       
	Запрос.УстановитьПараметр("ОбъектСистемы", Справочники.ИдентификаторыОбъектовМетаданных.НайтиПоРеквизиту("ПолноеИмя", Объект.Метаданные().ПолноеИмя()));
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	Возврат НЕ Запрос.Выполнить().Пустой();
	
КонецФункции
